Repository: soffes/shares-l10n
Catalog: *.lproj/Localizable.strings
Languages: ar, de, ru

source: Add Shares
ar: إضافة أسهم
de: Aktien hinzufügen
ru: Добавить акции

# STOCK_PLACEHOLDER
source: STOCK
ar: رمز الشركة
de: AKTIE
ru: Ценные бумаги

source: Add
ar: إضافة
de: Hinzufügen
ru: Добавить

# ADD_HELP_MESSAGE
source: Add shares for a stock you’ve purchased. Enter the stock symbol, number of shares you purchased, and price you purchased them at. The symbol will turn green if it’s valid.
ar: أضف الأسهم التي قمت بشرائها. أدخل رمز الشركة، عدد الأسهم، سعر الشراء، سوف يضيء الشعار باللون الاخضر اذا كان الإدخال صحيحاً
de: Fügen Sie Aktien von einem erworbenen Anteil hinzu. Geben sie das Symbol der Aktie, die Anzahl der Aktien sowie den Preis an, zu dem Sie die Aktie erworben haben. Das Aktien-Symbol wird sich grün färben, wenn es gültig ist.
ru: Добавьте купленные акции. Введите символ, обозначающий данные ценные бумаги, количество приобретенных акций и цену, по которой вы их приобрели. Символ станет зеленым, если все верно.

source: OK
ar: موافق

source: Symbol
ar: الشعار
ru: Символ

source: Shares
ar: الأسهم
de: Aktien
ru: Акции

source: Price
ar: السعر
de: Preis
ru: Цена

# SWIPE_TO_REMOVE
source: Swipe to remove shares.
ar: مرر للحذف
de: Streichen, um Aktien zu entfernen.
ru: Проведите пальцем в сторону, чтобы удалить акции.

source: Settings
ar: الإعدادات
de: Einstellungen
ru: Настройки

# MARKET_PRICE_MODE
source: All prices will be displayed in market currency.
ar: كل الأسعار تظهر بحسب عملة السوق
de: Alle Preise werden in der Markt-Währung angezeigt.
ru: Все цены будут показаны в валюте рынка.

# PRIMARY_CURRENCY_PRICE_MODE_FORMAT
source: All prices will be displayed in %@.
ar: %@ كل الأسعر الظاهرة بـ
de: All Preise werden in %@ angezeigt.
ru: Все цены будут показаны в %@.

# CURRENCY_LAST_UPDATED_FORMAT
source: Conversion rates updated %@ ago.
ar: أخر تحديث منذ %@
de: Die Umrechnungskurse wurden vor %@ aktualisiert.
ru: Курсы валют обновлены %@ назад.

source: Currency
ar: العملة
de: Währung
ru: Валюта

source: Display
ar: عرض
de: Anzeige
ru: Отображать

source: Primary
ar: العملة الأساسية
de: Hauptwährung
ru: Основная

source: Always Use Primary
ar: دائماً إستخدم العملة الأساسية
de: Immer Hauptwährung nutzen
ru: Всегда использовать основную валюту

source: Percentages
ar: النسبة
de: Prozentsätze
ru: Проценты

source: Decimal Places
ar: الأعداد العشرية
de: Dezimalstellen
ru: Количество цифр после запятой

source: Hide Artwork
ar: إخفاء المؤثرات
de: Artwork ausblenden
ru: Спрятать изображения

# WELCOME_TITLE
source: Hi there.
ar: مرحباً
de: Hi!
ru: Привет.

# WELCOME_MESSAGE
source: Shares helps you keep track of your gains and losses. To get started, add some shares that you’ve already purchased.
ar: شيرز يساعدك في متابعة خسارتك وأرباحك، لتبدأ قم بإدخال الأسهم التي قمت بشرائها
de: Shares hilft ihnen, den Überblick über Ihre Gewinne und Verluste zu behalten. Fügen Sie ein paar Aktien hinzu, die Sie bisher erworben haben, um loszulegen.
ru: Shares помогает следить за тем, сколько вы заработали или потеряли на рынках ценных бумаг. Чтобы начать, добавьте некоторые из приобретенных акций.

# WELCOME_GAINS
source: gains
ar: أرباح
de: Gewinne
ru: заработали

# WELCOME_LOSSES
source: losses
ar: خسائر
de: Verluste
ru: потеряли

# TUTORIAL_TOGGLE
source: Tap the total to toggle $ & %
ar: إضغط على المجموع للتبديل $ & %
de: Tippen Sie, um $ & % zu togglen.
ru: Нажмите на сумму, чтобы переключиться между $ и %

# TUTORIAL_DETAILS
source: Tap a stock to get details
ar: إضغط على السعم للتفاصيل
de: Tippen Sie auf eine Aktie, um Details zu erhalten.
ru: Нажмите, чтобы увидеть детали

source: Gain
ar: ربح
de: Gewinn
ru: Прибыль

source: Loss
ar: خسارة
de: Verlust
ru: Убыток

source: Darn
ar: مشكلة
de: Fehler
ru: Проклятье

# ERROR_FAILED_TO_UPDATE
source: Failed to update stocks. Be sure you’re connected to the internet.
ar: حصل خطاء أثناء التحديث، تأكد من إتصالك بالإنترنت
de: Die Aktualisierung ihrer Aktien ist fehlgeschlagen. Gehen Sie sicher, dass sie mit dem Internet verbunden sind.
ru: Неудалось обновить данные. Убедитесь, что вы подключены к интернету.

# TODAY_FORMAT
source: %@ Today
ar: %@ اليوم
de: Heutiger %@
ru: %@ Сегодня

# OVERALL_FORMAT
source: %@ Today
ar: %@ اليوم
de: %@ heute
ru: %@ Сегодня

source: Total Value
ar: القيمة الإجمالية
de: Totaler Betrag
ru: Всего

source: Total Gain
ar: إجمالي الربح
de: Gesamter Gewinn
ru: Общая прибыль

source: Total Loss
ar: إجمالي الخسارة
de: Gesamter Verlust
ru: Общий убыток

source: Change
ar: التغير
de: Wechsel
ru: Динамика

source: Investment
ar: الإستثمار
de: Investition
ru: Вклады

source: Value
ar: القيمة
de: Wert
ru: Значение
